modules/zuora/test/fixtures/subscription.json

{
  "success": true,
  "id": "8ad093fb8fbea5ec018fbfd13d741085",
  "accountId": "8ad094b98906cf8001891b3c82fc0c95",
  "accountNumber": "A00603520",
  "accountName": "0019E00002HilfxQAB",
  "invoiceOwnerAccountId": "8ad094b98906cf8001891b3c82fc0c95",
  "invoiceOwnerAccountNumber": "A00603520",
  "invoiceOwnerAccountName": "0019E00002HilfxQAB",
  "subscriptionNumber": "A-S00602370",
  "version": 5,
  "revision": "5.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2023-07-03",
  "serviceActivationDate": "2023-07-03",
  "customerAcceptanceDate": "2023-07-03",
  "subscriptionStartDate": "2023-07-03",
  "subscriptionEndDate": "2024-07-03",
  "lastBookingDate": "2024-05-28",
  "termStartDate": "2023-07-03",
  "termEndDate": "2024-07-03",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 20.00,
  "totalContractedValue": 130.00,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "db5adfdd-b6ac-8f78-0000-00000000d88a",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "8ad094b98906cf8001891b3c83120c98",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "test",
    "lastName": "user",
    "nickname": null,
    "workEmail": "test@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad094b98906cf8001891b3c82fc0c95",
    "accountNumber": "A00603520"
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "8ad094b98906cf8001891b3c83120c98",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "test",
    "lastName": "user",
    "nickname": null,
    "workEmail": "test@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad094b98906cf8001891b3c82fc0c95",
    "accountNumber": "A00603520"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8ad093fb8fbea5ec018fbfd13cb9107c",
      "lastChangeType": "Update",
      "productId": "8ad09fc281de1ce70181de3b23b2363d",
      "productName": "Supporter Plus",
      "productSku": "SKU-00000072",
      "productRatePlanId": "8ad08cbd8586721c01858804e3275376",
      "productRatePlanNumber": null,
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01003587",
      "ratePlanCharges": [
        {
          "id": "8ad093fb8fbea5ec018fbfd13ddb1092",
          "originalChargeId": "8ad0889d8906c12101891b61d98b0274",
          "productRatePlanChargeId": "8ad09ea0858682bb0185880ac57f4c4c",
          "number": "C-01006176",
          "name": "Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2024-06-03",
          "effectiveEndDate": "2024-07-03",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.000000000,
          "dmrc": 10.000000000,
          "tcv": 10.000000000,
          "dtcv": 10.000000000,
          "originalOrderDate": "2024-06-03",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 10.000000000,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP10",
          "price": 10.000000000,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-00905057",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2023-07-03",
      "endDate": "2024-07-03",
      "status": "Active"
    },
    {
      "startDate": "2024-07-03",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-05-28 16:28:32",
  "updateTime": "2024-05-28 16:28:32"
}