modules/zuora/test/fixtures/subscriptions-from-account-number-response.json

{
  "subscriptions": [
    {
      "id": "71a123b163b92f9139a30a5c32890372",
      "accountId": "8ad08aef8455bb55018456db283433a3",
      "accountNumber": "A00438946",
      "accountName": "0019E000024BwrlQAC",
      "invoiceOwnerAccountId": "8ad08aef8455bb55018456db283433a3",
      "invoiceOwnerAccountNumber": "A00438946",
      "invoiceOwnerAccountName": "0019E000024BwrlQAC",
      "subscriptionNumber": "A-S00445804",
      "version": 3,
      "revision": "3.0",
      "termType": "TERMED",
      "invoiceSeparately": false,
      "contractEffectiveDate": "2022-11-08",
      "serviceActivationDate": "2022-11-08",
      "customerAcceptanceDate": "2022-11-08",
      "subscriptionStartDate": "2022-11-08",
      "subscriptionEndDate": "2025-11-08",
      "lastBookingDate": "2024-11-08",
      "termStartDate": "2024-11-08",
      "termEndDate": "2025-11-08",
      "initialTerm": 12,
      "initialTermPeriodType": "Month",
      "currentTerm": 12,
      "currentTermPeriodType": "Month",
      "autoRenew": true,
      "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
      "renewalTerm": 12,
      "renewalTermPeriodType": "Month",
      "currency": "USD",
      "contractedMrr": 30,
      "totalContractedValue": 1080,
      "notes": null,
      "status": "Active",
      "TrialPeriodPrice__c": null,
      "CanadaHandDelivery__c": null,
      "AcquisitionMetadata__c": null,
      "QuoteNumber__QT": null,
      "GifteeIdentityId__c": null,
      "OpportunityName__QT": null,
      "LastQSSPaymentDate__c": null,
      "GiftNotificationEmailDate__c": null,
      "Gift_Subscription__c": "No",
      "TrialPeriodDays__c": null,
      "CreatedRequestId__c": "3e63c2fd-fef1-3c04-0000-000000003d5c",
      "ActivationDate3__c": null,
      "AcquisitionSource__c": null,
      "CreatedByCSR__c": null,
      "CASSubscriberID__c": null,
      "LastPriceChangeDate__c": null,
      "InitialPromotionCode__c": null,
      "Suspended__c": "false",
      "CpqBundleJsonId__QT": null,
      "RedemptionCode__c": null,
      "QuoteType__QT": null,
      "GiftRedemptionDate__c": null,
      "QuoteBusinessType__QT": null,
      "SupplierCode__c": null,
      "legacy_cat__c": null,
      "DeliveryAgent__c": null,
      "AcquisitionCase__c": null,
      "ReaderType__c": "Direct",
      "ActivationDate__c": null,
      "UserCancellationReason__c": null,
      "SuspensionStatus__c": "Active",
      "CardCountry__c": null,
      "OpportunityCloseDate__QT": null,
      "IPaddress__c": null,
      "IPCountry__c": null,
      "CancelledBy__c": null,
      "dummy__c": null,
      "PromotionCode__c": null,
      "OriginalSubscriptionStartDate__c": null,
      "LegacyContractStartDate__c": null,
      "CancellationReason__c": null,
      "billToContact": {
        "id": "8ad08aef8455bb55018456db284d33ae",
        "address1": null,
        "address2": null,
        "city": null,
        "country": "United States",
        "county": null,
        "fax": null,
        "state": "Alabama",
        "postalCode": null,
        "firstName": "Paul",
        "lastName": "Dempsey",
        "nickname": null,
        "workEmail": "paul.dempsey+test#36@guardian.co.uk",
        "personalEmail": null,
        "homePhone": null,
        "mobilePhone": null,
        "otherPhone": null,
        "otherPhoneType": null,
        "taxRegion": null,
        "workPhone": null,
        "contactDescription": null,
        "Company_Name__c": null,
        "SpecialDeliveryInstructions__c": null,
        "Title__c": null,
        "zipCode": null,
        "accountId": "8ad08aef8455bb55018456db283433a3",
        "accountNumber": "A00438946"
      },
      "paymentTerm": null,
      "invoiceTemplateId": null,
      "invoiceTemplateName": null,
      "sequenceSetId": null,
      "sequenceSetName": null,
      "soldToContact": {
        "id": "8ad08aef8455bb55018456db284d33ae",
        "address1": null,
        "address2": null,
        "city": null,
        "country": "United States",
        "county": null,
        "fax": null,
        "state": "Alabama",
        "postalCode": null,
        "firstName": "Paul",
        "lastName": "Dempsey",
        "nickname": null,
        "workEmail": "paul.dempsey+test#36@guardian.co.uk",
        "personalEmail": null,
        "homePhone": null,
        "mobilePhone": null,
        "otherPhone": null,
        "otherPhoneType": null,
        "taxRegion": null,
        "workPhone": null,
        "contactDescription": null,
        "Company_Name__c": null,
        "SpecialDeliveryInstructions__c": null,
        "Title__c": null,
        "zipCode": null,
        "accountId": "8ad08aef8455bb55018456db283433a3",
        "accountNumber": "A00438946"
      },
      "isLatestVersion": true,
      "cancelReason": null,
      "ratePlans": [
        {
          "id": "71a123b163b92f9139a30a5c32920374",
          "productId": "8ad09fc281de1ce70181de3b23b2363d",
          "productName": "Supporter Plus",
          "productSku": "SKU-00000072",
          "productRatePlanId": "8ad09fc281de1ce70181de3b251736a4",
          "productRatePlanNumber": null,
          "ratePlanName": "Supporter Plus Monthly",
          "subscriptionProductFeatures": [],
          "externallyManagedPlanId": null,
          "subscriptionRatePlanNumber": null,
          "isFromExternalCatalog": false,
          "ratePlanCharges": [
            {
              "id": "71a123b163b92f9139a30a5c32970376",
              "originalChargeId": "8ad08aef8455bb55018456db289333c6",
              "productRatePlanChargeId": "8ad09fc281de1ce70181de3b253e36a6",
              "number": "C-00741815",
              "name": "Supporter Plus Monthly",
              "productRatePlanChargeNumber": null,
              "type": "Recurring",
              "model": "FlatFee",
              "originalListPrice": null,
              "uom": null,
              "version": 3,
              "subscriptionChargeDeliverySchedule": null,
              "numberOfDeliveries": null,
              "priceChangeOption": "NoChange",
              "priceIncreasePercentage": null,
              "currency": "USD",
              "chargeModelConfiguration": null,
              "inputArgumentId": null,
              "includedUnits": null,
              "overagePrice": null,
              "applyDiscountTo": null,
              "discountLevel": null,
              "discountClass": null,
              "applyToBillingPeriodPartially": false,
              "billingDay": "ChargeTriggerDay",
              "listPriceBase": "Per_Billing_Period",
              "specificListPriceBase": null,
              "billingPeriod": "Month",
              "specificBillingPeriod": null,
              "billingTiming": "IN_ADVANCE",
              "ratingGroup": null,
              "billingPeriodAlignment": "AlignToCharge",
              "quantity": 1,
              "prorationOption": null,
              "isStackedDiscount": false,
              "reflectDiscountInNetAmount": false,
              "smoothingModel": null,
              "numberOfPeriods": null,
              "overageCalculationOption": null,
              "overageUnusedUnitsCreditOption": null,
              "unusedUnitsCreditRates": null,
              "usageRecordRatingOption": null,
              "segment": 1,
              "effectiveStartDate": "2022-11-08",
              "effectiveEndDate": "2025-11-08",
              "processedThroughDate": "2024-11-08",
              "chargedThroughDate": "2024-12-08",
              "done": false,
              "triggerDate": null,
              "triggerEvent": "CustomerAcceptance",
              "endDateCondition": "Subscription_End",
              "upToPeriodsType": null,
              "upToPeriods": null,
              "specificEndDate": null,
              "mrr": 30,
              "dmrc": 0,
              "tcv": 1080,
              "dtcv": 360,
              "originalOrderDate": "2022-11-08",
              "amendedByOrderOn": "2024-11-08",
              "description": "",
              "HolidayStart__c": null,
              "HolidayEnd__c": null,
              "ForceSync__c": null,
              "salesPrice": null,
              "tiers": null,
              "discountApplyDetails": null,
              "pricingSummary": "USD30",
              "price": 30,
              "discountAmount": null,
              "discountPercentage": null
            }
          ]
        }
      ],
      "orderNumber": "O-00961508",
      "externallyManagedBy": null,
      "statusHistory": [
        {
          "startDate": "2022-11-08",
          "endDate": "2025-11-08",
          "status": "Active"
        },
        {
          "startDate": "2025-11-08",
          "endDate": null,
          "status": "OutOfTerm"
        }
      ],
      "invoiceGroupNumber": null,
      "createTime": "2024-11-08 06:00:34",
      "updateTime": "2024-11-08 06:00:34",
      "scheduledCancelDate": null,
      "scheduledSuspendDate": null,
      "scheduledResumeDate": null
    }
  ],
  "success": true
}